results/iterations/redis_4kb_latency_iter6.txt
====== SET ======
  1000000 requests completed in 11.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 640313)
75.000% <= 0.295 milliseconds (cumulative count 871471)
87.500% <= 0.303 milliseconds (cumulative count 965539)
96.875% <= 0.311 milliseconds (cumulative count 989824)
99.219% <= 0.319 milliseconds (cumulative count 995188)
99.609% <= 0.327 milliseconds (cumulative count 996717)
99.805% <= 0.359 milliseconds (cumulative count 998062)
99.902% <= 0.471 milliseconds (cumulative count 999171)
99.951% <= 0.487 milliseconds (cumulative count 999655)
99.976% <= 0.495 milliseconds (cumulative count 999761)
99.988% <= 0.551 milliseconds (cumulative count 999880)
99.994% <= 1.135 milliseconds (cumulative count 999939)
99.997% <= 3.159 milliseconds (cumulative count 999970)
99.998% <= 3.423 milliseconds (cumulative count 999985)
99.999% <= 3.615 milliseconds (cumulative count 999993)
100.000% <= 3.695 milliseconds (cumulative count 999997)
100.000% <= 3.719 milliseconds (cumulative count 999999)
100.000% <= 3.743 milliseconds (cumulative count 1000000)
100.000% <= 3.743 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 32)
96.554% <= 0.303 milliseconds (cumulative count 965539)
99.852% <= 0.407 milliseconds (cumulative count 998519)
99.981% <= 0.503 milliseconds (cumulative count 999806)
99.989% <= 0.607 milliseconds (cumulative count 999895)
99.990% <= 0.703 milliseconds (cumulative count 999899)
99.990% <= 0.807 milliseconds (cumulative count 999902)
99.991% <= 0.903 milliseconds (cumulative count 999910)
99.992% <= 1.007 milliseconds (cumulative count 999923)
99.994% <= 1.103 milliseconds (cumulative count 999936)
99.995% <= 1.207 milliseconds (cumulative count 999948)
99.995% <= 1.303 milliseconds (cumulative count 999950)
99.997% <= 3.103 milliseconds (cumulative count 999966)
100.000% <= 4.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89806.91 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.285     0.104     0.287     0.303     0.319     3.743
====== GET ======
  1000000 requests completed in 11.28 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.127 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 576704)
75.000% <= 0.295 milliseconds (cumulative count 807236)
87.500% <= 0.303 milliseconds (cumulative count 922625)
93.750% <= 0.311 milliseconds (cumulative count 962236)
96.875% <= 0.319 milliseconds (cumulative count 975823)
98.438% <= 0.335 milliseconds (cumulative count 984998)
99.219% <= 0.415 milliseconds (cumulative count 992268)
99.609% <= 0.479 milliseconds (cumulative count 996278)
99.805% <= 0.551 milliseconds (cumulative count 998167)
99.902% <= 0.591 milliseconds (cumulative count 999172)
99.951% <= 0.623 milliseconds (cumulative count 999512)
99.976% <= 0.671 milliseconds (cumulative count 999764)
99.988% <= 0.735 milliseconds (cumulative count 999879)
99.994% <= 0.927 milliseconds (cumulative count 999939)
99.997% <= 1.231 milliseconds (cumulative count 999970)
99.998% <= 1.607 milliseconds (cumulative count 999985)
99.999% <= 1.967 milliseconds (cumulative count 999993)
100.000% <= 2.095 milliseconds (cumulative count 999997)
100.000% <= 2.151 milliseconds (cumulative count 999999)
100.000% <= 2.183 milliseconds (cumulative count 1000000)
100.000% <= 2.183 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 16)
92.263% <= 0.303 milliseconds (cumulative count 922625)
99.174% <= 0.407 milliseconds (cumulative count 991736)
99.694% <= 0.503 milliseconds (cumulative count 996940)
99.941% <= 0.607 milliseconds (cumulative count 999413)
99.983% <= 0.703 milliseconds (cumulative count 999832)
99.990% <= 0.807 milliseconds (cumulative count 999904)
99.993% <= 0.903 milliseconds (cumulative count 999926)
99.995% <= 1.007 milliseconds (cumulative count 999951)
99.996% <= 1.103 milliseconds (cumulative count 999960)
99.997% <= 1.207 milliseconds (cumulative count 999968)
99.997% <= 1.303 milliseconds (cumulative count 999974)
99.998% <= 1.407 milliseconds (cumulative count 999978)
99.998% <= 1.503 milliseconds (cumulative count 999982)
99.999% <= 1.607 milliseconds (cumulative count 999985)
99.999% <= 1.703 milliseconds (cumulative count 999987)
99.999% <= 1.807 milliseconds (cumulative count 999990)
99.999% <= 1.903 milliseconds (cumulative count 999991)
99.999% <= 2.007 milliseconds (cumulative count 999994)
100.000% <= 2.103 milliseconds (cumulative count 999997)
100.000% <= 3.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88636.77 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.289     0.120     0.287     0.311     0.383     2.183