results/iterations/redis_4kb_latency_iter7.txt
====== SET ======
  1000000 requests completed in 11.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 527405)
75.000% <= 0.295 milliseconds (cumulative count 765128)
87.500% <= 0.303 milliseconds (cumulative count 891523)
93.750% <= 0.311 milliseconds (cumulative count 939191)
96.875% <= 0.327 milliseconds (cumulative count 970789)
98.438% <= 0.351 milliseconds (cumulative count 985330)
99.219% <= 0.399 milliseconds (cumulative count 992343)
99.609% <= 0.479 milliseconds (cumulative count 996437)
99.805% <= 0.519 milliseconds (cumulative count 998053)
99.902% <= 0.591 milliseconds (cumulative count 999072)
99.951% <= 0.655 milliseconds (cumulative count 999578)
99.976% <= 0.695 milliseconds (cumulative count 999756)
99.988% <= 0.847 milliseconds (cumulative count 999878)
99.994% <= 1.007 milliseconds (cumulative count 999940)
99.997% <= 1.135 milliseconds (cumulative count 999971)
99.998% <= 1.207 milliseconds (cumulative count 999985)
99.999% <= 1.263 milliseconds (cumulative count 999993)
100.000% <= 1.335 milliseconds (cumulative count 999997)
100.000% <= 1.383 milliseconds (cumulative count 999999)
100.000% <= 1.391 milliseconds (cumulative count 1000000)
100.000% <= 1.391 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 17)
89.152% <= 0.303 milliseconds (cumulative count 891523)
99.296% <= 0.407 milliseconds (cumulative count 992955)
99.763% <= 0.503 milliseconds (cumulative count 997633)
99.922% <= 0.607 milliseconds (cumulative count 999222)
99.976% <= 0.703 milliseconds (cumulative count 999764)
99.986% <= 0.807 milliseconds (cumulative count 999856)
99.990% <= 0.903 milliseconds (cumulative count 999896)
99.994% <= 1.007 milliseconds (cumulative count 999940)
99.996% <= 1.103 milliseconds (cumulative count 999963)
99.999% <= 1.207 milliseconds (cumulative count 999985)
99.999% <= 1.303 milliseconds (cumulative count 999995)
100.000% <= 1.407 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88339.23 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.290     0.112     0.287     0.319     0.383     1.391
====== GET ======
  1000000 requests completed in 11.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 568081)
75.000% <= 0.295 milliseconds (cumulative count 797974)
87.500% <= 0.303 milliseconds (cumulative count 910086)
93.750% <= 0.311 milliseconds (cumulative count 950495)
96.875% <= 0.327 milliseconds (cumulative count 977295)
98.438% <= 0.343 milliseconds (cumulative count 986480)
99.219% <= 0.383 milliseconds (cumulative count 992460)
99.609% <= 0.471 milliseconds (cumulative count 996242)
99.805% <= 0.535 milliseconds (cumulative count 998105)
99.902% <= 0.575 milliseconds (cumulative count 999206)
99.951% <= 0.591 milliseconds (cumulative count 999599)
99.976% <= 0.607 milliseconds (cumulative count 999766)
99.988% <= 0.647 milliseconds (cumulative count 999888)
99.994% <= 0.887 milliseconds (cumulative count 999939)
99.997% <= 1.223 milliseconds (cumulative count 999970)
99.998% <= 1.455 milliseconds (cumulative count 999985)
99.999% <= 1.623 milliseconds (cumulative count 999993)
100.000% <= 1.711 milliseconds (cumulative count 999997)
100.000% <= 1.743 milliseconds (cumulative count 999999)
100.000% <= 1.767 milliseconds (cumulative count 1000000)
100.000% <= 1.767 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 20)
91.009% <= 0.303 milliseconds (cumulative count 910086)
99.410% <= 0.407 milliseconds (cumulative count 994105)
99.757% <= 0.503 milliseconds (cumulative count 997574)
99.977% <= 0.607 milliseconds (cumulative count 999766)
99.993% <= 0.703 milliseconds (cumulative count 999926)
99.993% <= 0.807 milliseconds (cumulative count 999931)
99.994% <= 0.903 milliseconds (cumulative count 999941)
99.995% <= 1.007 milliseconds (cumulative count 999951)
99.996% <= 1.103 milliseconds (cumulative count 999959)
99.997% <= 1.207 milliseconds (cumulative count 999969)
99.998% <= 1.303 milliseconds (cumulative count 999977)
99.998% <= 1.407 milliseconds (cumulative count 999983)
99.999% <= 1.503 milliseconds (cumulative count 999987)
99.999% <= 1.607 milliseconds (cumulative count 999992)
100.000% <= 1.703 milliseconds (cumulative count 999996)
100.000% <= 1.807 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88605.35 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.289     0.104     0.287     0.311     0.367     1.767