results/iterations/redis_4kb_latency_iter8.txt
====== SET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 588895)
75.000% <= 0.295 milliseconds (cumulative count 840389)
87.500% <= 0.303 milliseconds (cumulative count 951504)
96.875% <= 0.311 milliseconds (cumulative count 984577)
99.219% <= 0.319 milliseconds (cumulative count 993220)
99.609% <= 0.335 milliseconds (cumulative count 996609)
99.805% <= 0.383 milliseconds (cumulative count 998186)
99.902% <= 0.471 milliseconds (cumulative count 999151)
99.951% <= 0.487 milliseconds (cumulative count 999683)
99.976% <= 0.495 milliseconds (cumulative count 999802)
99.988% <= 0.519 milliseconds (cumulative count 999880)
99.994% <= 0.591 milliseconds (cumulative count 999943)
99.997% <= 0.919 milliseconds (cumulative count 999970)
99.998% <= 1.087 milliseconds (cumulative count 999986)
99.999% <= 1.175 milliseconds (cumulative count 999994)
100.000% <= 1.215 milliseconds (cumulative count 999997)
100.000% <= 1.239 milliseconds (cumulative count 999999)
100.000% <= 1.263 milliseconds (cumulative count 1000000)
100.000% <= 1.263 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 19)
95.150% <= 0.303 milliseconds (cumulative count 951504)
99.841% <= 0.407 milliseconds (cumulative count 998409)
99.984% <= 0.503 milliseconds (cumulative count 999845)
99.995% <= 0.607 milliseconds (cumulative count 999947)
99.995% <= 0.703 milliseconds (cumulative count 999953)
99.996% <= 0.807 milliseconds (cumulative count 999961)
99.997% <= 0.903 milliseconds (cumulative count 999968)
99.998% <= 1.007 milliseconds (cumulative count 999979)
99.999% <= 1.103 milliseconds (cumulative count 999987)
100.000% <= 1.207 milliseconds (cumulative count 999996)
100.000% <= 1.303 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89381.48 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.303     0.319     1.263
====== GET ======
  1000000 requests completed in 11.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 584563)
75.000% <= 0.295 milliseconds (cumulative count 820219)
87.500% <= 0.303 milliseconds (cumulative count 941789)
96.875% <= 0.311 milliseconds (cumulative count 982884)
98.438% <= 0.319 milliseconds (cumulative count 993701)
99.609% <= 0.327 milliseconds (cumulative count 996726)
99.805% <= 0.343 milliseconds (cumulative count 998121)
99.902% <= 0.471 milliseconds (cumulative count 999200)
99.951% <= 0.487 milliseconds (cumulative count 999674)
99.976% <= 0.495 milliseconds (cumulative count 999772)
99.988% <= 0.559 milliseconds (cumulative count 999878)
99.994% <= 1.015 milliseconds (cumulative count 999939)
99.997% <= 9.071 milliseconds (cumulative count 999970)
99.998% <= 9.359 milliseconds (cumulative count 999985)
99.999% <= 9.519 milliseconds (cumulative count 999993)
100.000% <= 9.599 milliseconds (cumulative count 999997)
100.000% <= 9.631 milliseconds (cumulative count 999999)
100.000% <= 9.647 milliseconds (cumulative count 1000000)
100.000% <= 9.647 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 19)
94.179% <= 0.303 milliseconds (cumulative count 941789)
99.862% <= 0.407 milliseconds (cumulative count 998619)
99.984% <= 0.503 milliseconds (cumulative count 999838)
99.991% <= 0.607 milliseconds (cumulative count 999914)
99.992% <= 0.703 milliseconds (cumulative count 999922)
99.993% <= 0.807 milliseconds (cumulative count 999927)
99.993% <= 0.903 milliseconds (cumulative count 999933)
99.994% <= 1.007 milliseconds (cumulative count 999938)
99.994% <= 1.103 milliseconds (cumulative count 999943)
99.995% <= 1.207 milliseconds (cumulative count 999949)
99.995% <= 1.303 milliseconds (cumulative count 999950)
99.997% <= 9.103 milliseconds (cumulative count 999972)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89229.95 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.287     0.112     0.287     0.311     0.319     9.647